## Plan Result (dev_frontdoor)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web-pr-2057&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"
        name                                 = "sdshmcts-dev"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "development"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-vh-video-web-pr-1955" -> "healthProbeSettings-vh-video-web-pr-2057"
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/backendPools/vh-video-web-pr-1955"
          ~ load_balancing_name = "loadBalancingSettings-vh-video-web-pr-1955" -> "loadBalancingSettings-vh-video-web-pr-2057"
          ~ name                = "vh-video-web-pr-1955" -> "vh-video-web-pr-2057"

          ~ backend {
              ~ host_header = "vh-video-web-pr-1955.dev.platform.hmcts.net" -> "vh-video-web-pr-2057.dev.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/healthProbeSettings/healthProbeSettings-vh-video-web-pr-1955"
          ~ name                = "healthProbeSettings-vh-video-web-pr-1955" -> "healthProbeSettings-vh-video-web-pr-2057"
            # (5 unchanged attributes hidden)
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/loadBalancingSettings/loadBalancingSettings-vh-video-web-pr-1955"
          ~ name                            = "loadBalancingSettings-vh-video-web-pr-1955" -> "loadBalancingSettings-vh-video-web-pr-2057"
            # (3 unchanged attributes hidden)
        }

      ~ frontend_endpoint {
          ~ host_name                               = "vh-video-web-pr-1955.dev.platform.hmcts.net" -> "vh-video-web-pr-2057.dev.platform.hmcts.net"
            id                                      = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/vh-video-web-pr-1955"
          ~ name                                    = "vh-video-web-pr-1955" -> "vh-video-web-pr-2057"
          + web_application_firewall_policy_link_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebpr2057dev"
            # (2 unchanged attributes hidden)
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web-pr-1955",
              + "vh-video-web-pr-2057",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-web-pr-1955"
          ~ name               = "vh-video-web-pr-1955" -> "vh-video-web-pr-2057"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "vh-video-web-pr-1955" -> "vh-video-web-pr-2057"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web-pr-1955",
              + "vh-video-web-pr-2057",
            ]
            id                 = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/routingRules/vh-video-web-pr-1955HttpsRedirect"
          ~ name               = "vh-video-web-pr-1955HttpsRedirect" -> "vh-video-web-pr-2057HttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (140 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["vh-video-web-pr-2057"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev/frontendEndpoints/vh-video-web-pr-2057"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":530,"Program":"tfcmt","SHA1":"","Target":"dev_frontdoor","Vars":{}} -->